STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_dsi_lcd.c
/**
  ******************************************************************************
  * @file    stm32l4r9i_eval_dsi_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for DSI Liquid Crystal Display (LCD)
  *          module mounted on STM32L4R9I_EVAL evaluation board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* File Info: ------------------------------------------------------------------
                                   User NOTES
1. How To use this driver:
--------------------------
   - This driver is used to drive directly in command mode a LCD TFT using the
     DSI interface.
     The following IPs are implied : DSI Host IP block working
     in conjunction to the LTDC controller.
   - This driver is linked by construction to LCD.

2. Driver description:
----------------------
  + Initialization steps:
     o Initialize the LCD using the BSP_DSI_LCD_Init() function.
       Please note that LCD display will be turned on at the end of this function.
     o De-inietialize the LCD using BSP_DSI_LCD_DeInit() function.

  + Options
     o Modify in the fly the display properties using the following functions:
       - BSP_DSI_LCD_SetTransparency().
       - BSP_DSI_LCD_SetColorKeying().
       - BSP_DSI_LCD_ResetColorKeying().
       - BSP_DSI_LCD_SetFont().
       - BSP_DSI_LCD_SetBackColor().
       - BSP_DSI_LCD_SetTextColor().
       - BSP_DSI_LCD_SetBrightness().
     o You can set display on/off using following functions:
       - BSP_DSI_LCD_DisplayOn().
       - BSP_DSI_LCD_DisplayOff().

  + Display on LCD
     o First, check that frame buffer is available using BSP_DSI_LCD_IsFrameBufferAvailable().
     o When frame buffer is available, modify it using following functions:
       - BSP_DSI_LCD_Clear().
       - BSP_DSI_LCD_ClearStringLine().
       - BSP_DSI_LCD_DisplayChar().
       - BSP_DSI_LCD_DisplayStringAt().
       - BSP_DSI_LCD_DisplayStringAtLine().
       - BSP_DSI_LCD_DrawBitmap().
       - BSP_DSI_LCD_DrawCircle().
       - BSP_DSI_LCD_DrawEllipse().
       - ....
     o Call BSP_DSI_LCD_Refresh() to refresh LCD display.

------------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "stm32l4r9i_eval_lcd.h"
#include "stm32l4r9i_eval_dsi_lcd.h"
#include "stm32l4r9i_eval_gfxmmu_lut.h"
#include "stm32l4r9i_eval_io.h"
#include "../../../Utilities/Fonts/fonts.h"
#include "../../../Utilities/Fonts/font24.c"
#include "../../../Utilities/Fonts/font20.c"
#include "../../../Utilities/Fonts/font16.c"
#include "../../../Utilities/Fonts/font12.c"
#include "../../../Utilities/Fonts/font8.c"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L4R9I_EVAL
  * @{
  */

/** @defgroup STM32L4R9I_EVAL_LCD STM32L4R9I_EVAL LCD
  * @{
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD STM32L4R9I_EVAL DSI LCD
  * @{
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD_Private_Macros Private Macros
  * @{
  */
#define ABS(X)                 ((X) > 0 ? (X) : -(X))

#define POLY_X(Z)              ((int32_t)((Points + (Z))->X))
#define POLY_Y(Z)              ((int32_t)((Points + (Z))->Y))
/**
  * @}
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD_Exported_Variables Exported Variables
  * @{
  */
/* DMA2D handle */
DMA2D_HandleTypeDef  hdma2d_eval;

/**
  * @}
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD_Private_Variables Private Variables
  * @{
  */
/* LCD initialization status */
static uint32_t bsp_lcd_initialized = 0;
/* Flag to indicate if HSE has to be disabled during de-initialization */
static uint32_t bsp_lcd_hse_to_disable = 0;
/* Default Active LTDC Layer in which drawing is made is LTDC Layer Background */
static uint32_t  ActiveLayer = LTDC_ACTIVE_LAYER_BACKGROUND;
/* Current Drawing Layer properties variable */
static LCD_DrawPropTypeDef DrawProp[LTDC_MAX_LAYER_NUMBER];

/* Physical frame buffer for active layer */
/* 390*390 pixels with 32bpp - 20% */
#if defined ( __ICCARM__ )  /* IAR Compiler */
  #pragma data_alignment = 16
uint32_t              PhysFrameBuffer[121680];
#elif defined (__GNUC__)    /* GNU Compiler */
uint32_t              PhysFrameBuffer[121680] __attribute__ ((aligned (16)));
#else                       /* ARM Compiler */
__align(16) uint32_t  PhysFrameBuffer[121680];
#endif

/* Global variable used to know if frame buffer is available (1) or not because refresh is on going (0) */
__IO uint32_t FrameBufferAvailable = 1;
/* LCD size */
uint32_t lcd_x_size = 390;
uint32_t lcd_y_size = 390;
/* GFXMMU, LTDC and DSI handles */
GFXMMU_HandleTypeDef hgfxmmu_eval;
LTDC_HandleTypeDef   hltdc_eval;
DSI_HandleTypeDef    hdsi_eval;
/**
  * @}
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD_Private_FunctionPrototypes Private FunctionPrototypes
  * @{
  */
static void LCD_Reset(void);
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c);
static void FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3);
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex);
static void LL_ConvertLineToARGB8888(void * pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode);
/**
  * @}
  */

/** @defgroup STM32L4R9I_EVAL_DSI_LCD_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  Initialize the DSI LCD.
  * The initialization is done as below:
  *     - GFXMMU initialization
  *     - DSI PLL initialization
  *     - DSI initialization
  *     - LTDC initialization
  *     - RM67162 LCD Display IC Driver initialization
  * @retval LCD state
  */
uint8_t BSP_DSI_LCD_Init(void)
{
  if(bsp_lcd_initialized == 0)
  {
    LTDC_LayerCfgTypeDef    LayerCfg;
    DSI_PLLInitTypeDef      dsiPllInit;
    DSI_PHY_TimerTypeDef    PhyTimings;
    DSI_HOST_TimeoutTypeDef HostTimeouts;
    DSI_LPCmdTypeDef        LPCmd;
    DSI_CmdCfgTypeDef       CmdCfg;

    /* Toggle Hardware Reset of the DSI LCD using its XRES signal (active low) */
    LCD_Reset();

    /* Call first MSP Initialize
     * This will set IP blocks LTDC, DSI and DMA2D
     * - out of reset
     * - clocked
     * - NVIC IRQ related to IP blocks enabled
    */
    BSP_DSI_LCD_MspInit();

    /************************/
    /* GFXMMU CONFIGURATION */
    /************************/
    hgfxmmu_eval.Instance = GFXMMU;
    __HAL_GFXMMU_RESET_HANDLE_STATE(&hgfxmmu_eval);
    hgfxmmu_eval.Init.BlocksPerLine                     = GFXMMU_192BLOCKS;
    hgfxmmu_eval.Init.DefaultValue                      = 0xFFFFFFFF;
    hgfxmmu_eval.Init.Buffers.Buf0Address               = (uint32_t) PhysFrameBuffer;
    hgfxmmu_eval.Init.Buffers.Buf1Address               = 0; /* NU */
    hgfxmmu_eval.Init.Buffers.Buf2Address               = 0; /* NU */
    hgfxmmu_eval.Init.Buffers.Buf3Address               = 0; /* NU */
    hgfxmmu_eval.Init.Interrupts.Activation             = DISABLE;
    hgfxmmu_eval.Init.Interrupts.UsedInterrupts         = GFXMMU_AHB_MASTER_ERROR_IT; /* NU */
    if(HAL_OK != HAL_GFXMMU_Init(&hgfxmmu_eval))
    {
      return(LCD_ERROR);
    }

